---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCTransformSetter.Initialize(Autodesk.Revit.DB.IFC.ExporterIFC,Autodesk.Revit.DB.Transform)
source: html/a40ff3af-e21f-81bb-8db2-ec4fdae1fc5d.htm
---
# Autodesk.Revit.DB.IFC.IFCTransformSetter.Initialize Method

Initializes the transformation in the transform setter.

## Syntax (C#)
```csharp
public void Initialize(
	ExporterIFC exporterIFC,
	Transform transform
)
```

## Parameters
- **exporterIFC** (`Autodesk.Revit.DB.IFC.ExporterIFC`) - The exporter.
- **transform** (`Autodesk.Revit.DB.Transform`) - The transform.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null